export const DESCRIPTIONS= {
  INITIAL: `CYBERWARSは、セキュリティ学習の入り口となるプラットフォームです。対戦形式は1対1。3つのフェーズを通し、より多くのポイントを獲得したプレイヤーの勝利となります。`,
  ATTACK_PHASE: [
    `アタックフェーズでは、課題webサイトを攻撃し、どれだけ情報を盗み出せるかを競います。SQLインジェクションやOSコマンドインジェクションを駆使し、相手より多くの情報を盗み出しましょう。`,
    `SQLインジェクション : 
    悪意のあるユーザーがWebアプリケーションやデータベースシステムに対してSQLクエリを注入し、不正な操作を行う攻撃。
    OSコマンドインジェクション : 
    コマンドを実行できる脆弱性を悪用する攻撃。`
  ],
  DEFENCE_PHASE: `ディフェンスフェーズでは、アタックフェーズで気づいた課題webサイトの脆弱性を、直接コーディングして修正します。`,
  BATTLE_PHASE: `バトルフェーズでは、ディフェンスフェーズで相手が改善した課題Webサイトに攻撃を仕掛けます。相手が改善した課題Webサイトの脆弱性を見つけ出せるかが勝敗を左右します。`,
  EXPLANATION: `解説モードでは、課題Webサイトの脆弱性、防御例、攻撃例を解説します。`,
  END: `訓練モードは以上です。対戦モードで、実際に対戦してみましょう。`
};